{
  "title": "5 Promising Blockchain Startups In 2017",
  "textMD": "# 5 Promising Blockchain Startups in 2017\n\nEveryone has heard of Bitcoin, but not many understand the potential of the blockchain -- the foundation upon which Bitcoin was built. For the uninitiated,\n>\"a blockchain is a **ledger** of **facts**, replicated across several computers assembled in a peer-to-peer network. Facts can be anything from monetary transactions to content signature. Members of the network are anonymous individuals called **nodes**. All communication inside the network takes advantage of cryptography to securely identify the sender and the receiver. When a node wants to add a fact to the ledger, a consensus forms in the network to determine where this fact should appear in the ledger; this consensus is called a **block**.\"\n\n[This article](https://marmelab.com/blog/2016/04/28/blockchain-for-web-developers-the-theory.html) is a great resource for those that want to dig into the nuts and bolts of how a blockchain works behind the scenes.\n\n### Why decentralize?\n\nThis new blockchain technology is not unique to cryptocurrency. Vitalik Buterin, the creator of Ethereum, describes the benefits of decentralization as follows:\n\n* Fault tolerance - use redundancy to reduce risk of a system failing accidentally.\n\n* Attack resistance - cost of attack sublinear, so splitting a system into components makes attacks more costly.\n\n* Collusion resistance - making it more difficult for a sub-group of a community to act in its own self benefit at everyone else's expense.\n\n* Efficiency (sometimes) - decentralization may be more efficient due to diseconomies of scale or spare capacity considerations.\n\nClearly, these benefits can apply to many large industries. Let's look at some startup companies that are leveraging blockchain technology to change the future of their respective industries.\n\n## [1. Opus Foundation](https://opus-foundation.org/)\n\nAs an avid music fan this project immediately stood out to me. Streaming services like Spotify and Apple Music have nearly taken over the music industry. They have control over which artists get featured on playlists, and they have the power to censor any artist they might not agree with. Not to mention these streaming services take up over 70% of the artist's revenue. A decentralized music platform like Opus has the power to completely cut out middlemen like Spotify and allow users to stream any music they want by paying the artist directly.\n\n\n\n## [2. IPFS](https://ipfs.io/)\n\nIPFS is a new P2P protocol that is trying to replace HTTP by creating a faster distributed web. It does this by getting pieces of information from multiple computers simultaneously rather than from a single computer at a time, potentially saving up to 60% in bandwidth costs for video delivery. IPFS's distributed network promises resilience to service providers going offline, natural disasters, intermittent connections, and improves accessibility for the developing world.\n\n\n\n## [3. Storj](https://storj.io/)\n\nStorj is an encrypted cloud storage, using distributed networking to provide high availability and incredible performance. Ever get nervous about Google and Apple having access to your personal information stored in Google Drive and iCloud? Storj will give you back your privacy while improving user experience.\n\n## [4. LBRY](https://lbry.io/)\n\nLBRY aims to be the first digital marketplace to be controlled by the markets' participants rather than a corporation or other 3rd-party. With companies like Youtube becoming more and more comfortable with exercising their power over the content that uploaders get paid for, it won't be hard for a project like LBRY to find its user base.\n\n## [5. Hashed Health](https://hashedhealth.com/)\n\nHashed Health is a consortium of companies that use blockchain technology to improve the healthcare industry. They claim to reduce cost by eliminating manual processes, increase speed of transactions through immediate distribution, increase security through cryptography, and reduce fraud.\n\n### Conclusion\n\nThe blockchain ecosystem is growing rapidly. Some of the startups here aren't the only ones in their particular niche, for example [Musicoin](https://musicoin.org/) is another blockchain project trying to change up they way people consume music. It's hard to say how long it'll take for organizations like the ones listed above to enter the mainstream, but there's no doubt that they will revolutionize industries that impact our every day life.",
  "excerpt": "Everyone has heard of Bitcoin, but not many understand the potential of the blockchain -- the foundation upon which Bitcoin was built.",
  "date": "Oct. 8th, 2017",
  "featured": false,
  "tags": "blockchain, new tech"
}