{
  "title": "Blockstack: My First Open Source Contribution",
  "textMD": "# Blockstack: My First Open Source Contribution\n\n## What is Blockstack?\n\nBlockstack is a new internet for decentralized applications where users own their data. The creators of Blockstack propose that their new browser along with their API that leverages blockchain technology is all you need to start building applications for a new decentralized internet.\n\nThere are 3 main features of the Blockstack API:\n\n* **Identity** - users get digital keys that let them own their identity and sign in to apps locally without remote servers or identity providers like Google or Facebook.\n* **Storage** - users are able to bring their own storage providers to control their data, which is encrypted and easily shared between applications.\n* **Tokens** - blockstack uses Bitcoin and other crypto-currencies for simple peer-to-peer payments, allowing developers to charge for downloads subscriptions, and more.\n\nThere has been a core team of developers working under Blockstack Inc since 2014 (co-founded by Muneeb Ali and Ryan Shea), but as the open source community continues to grow we will see more independent individuals and companies taking on greater roles in the protocol's development.\n\n## What problems does Blockstack solve?\n\nThe applications developed for the internet that we use today are problematic because (1) apps own the user's data and are therefore a target for malicious actors, and (2) users don't control access to the data -- they can only advise the application on how to control access which the app can ignore. Blockstack solves both problems by making it possible for developers to build web applications where:\n\n* the user owns their data\n* the user controls where the data is stored\n* the user controls who can access their data\n* the user doesn't have to deal with new passwords for each application\n* the developer doesn't have to host everyone's data\n* the developer doesn't have to run app-specific servers\n\nBlockstack ensures the data is safe with advanced cryptography algorithms along with blockchain technology, so that users can effectively treat storage providers (Dropbox, Google Drive) like dumb hard drives. If a user is unhappy with their storage provider they can always switch to a different provider and transfer their data, since it was never the application's in the first place.\n\nIf you want to get a better understanding of how Blockstack works under the hood you can check out the system design diagram below as well as their [FAQ page](https://blockstack.org/faq).\n\n## My first open source contribution\n\nAs someone who has been interested in blockchain technology for sometime and has been looking to enter the world of open source projects, I was thrilled to discover a thriving community surrounding Blockstack. After digging through the project on GitHub I found an issue that I knew I could resolve.\n\nThe issue requested a password strength indicator for the `sign up` and `forgot password` pages in the Blockstack Browser. After forking the project, all I had to do was install the `zxcvbn` library created by Dropbox to calculate the strength score of a phrase, check the password field of the component's state whenever the input field changes, and display an indicator that reflects the current password score. If the password is too weak then the user will not be able to submit. You can see the result of my pull request below.\n\nI'm looking forward to getting more involved with the Blockstack community, and am planning to develop my first decentralized application with their platform. I strongly encourage anyone who is interested in getting started with open source to seek out projects that you're passionate about. You can find some great issues for first timers at websites like [Up For Grabs](http://up-for-grabs.net/#/tags/javascript) and [Code Triage](https://www.codetriage.com/?language=JavaScript).\n\nOnce you've found a project and an issue that you feel capable of tackling, the steps to submitting a pull request are as simple as:\n\n* Fork the repository and clone it locally. Pull in changes often so that you are up to date when you submit your pull request.\n* Create a branch for your edits.\n* Make the edits that resolve or fix an issue.\n* Reference the relevant issues and documentation when submitting your pull request (eg \"Resolves #425\").\n* Include screenshots of the before and after if your changes include HTML/CSS.\n* Test your changes before submitting. Most major projects will have a suite of tests available to run, ensuring the code works and is in line with the syntactic style of the rest of the project.\n* Submit your pull request on GitHub.\n\nThere are [plenty of resources](https://opensource.guide/) out there if you want more information on how to get started with open source. Until next time, happy coding!",
  "excerpt": "Blockstack is a new internet for decentralized applications where users own their data. Here I give an overview of its features and how I made my first open source contribution to the platform.",
  "date": "Nov. 21st, 2017",
  "featured": false,
  "tags": "Blockstack, blockchain, open source"
}